vocabularies/index.html
---
layout: default
---

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Installing the FirefoxOS application</h2>
<div class="outline-text-2" id="text-1">
<style type="text/css">
.btn {
  background: #34d960;
  background-image: -webkit-linear-gradient(top, #34d960, #42b82b);
  background-image: -moz-linear-gradient(top, #34d960, #42b82b);
  background-image: -ms-linear-gradient(top, #34d960, #42b82b);
  background-image: -o-linear-gradient(top, #34d960, #42b82b);
  background-image: linear-gradient(to bottom, #34d960, #42b82b);
  -webkit-border-radius: 10;
  -moz-border-radius: 10;
  border-radius: 10px;
  -webkit-box-shadow: 2px 2px 3px #666666;
  -moz-box-shadow: 2px 2px 3px #666666;
  box-shadow: 2px 2px 3px #666666;
  font-family: Arial;
  color: #ffffff;
  font-size: 20px;
  padding: 10px 20px 10px 20px;
  text-decoration: none;
}
.btn:hover {
  background: #34b81a;
  background-image: -webkit-linear-gradient(top, #34b81a, #149127);
  background-image: -moz-linear-gradient(top, #34b81a, #149127);
  background-image: -ms-linear-gradient(top, #34b81a, #149127);
  background-image: -o-linear-gradient(top, #34b81a, #149127);
  background-image: linear-gradient(to bottom, #34b81a, #149127);
  text-decoration: none;
}
</style>

<script type="text/javascript">
function installVocabularyOnFFOS() {
    var manifestUrl = 'http://v.btranslator.org/manifest.webapp';
    var request = window.navigator.mozApps.install(manifestUrl);
    request.onsuccess = function () {
        // Save the App object that is returned
        var appRecord = this.result;
        alert('Installation successful!');
    };
    request.onerror = function () {
        // Display the error information from the DOMError object
        alert('Install failed, error: ' + this.error.name);
    };
}
</script>

<div style="padding: 10px;">
<a href="javascript:installVocabularyOnFFOS()" class="btn">Install on Firefox OS</a>
<a href="https://marketplace.firefox.com/app/vocabulary/" class="btn">View on the Marketplace</a>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Installing the mobile application</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Fork <a href="https://github.com/B-Translator/vocabulary-jquery">https://github.com/B-Translator/vocabulary-jquery</a> or
<a href="https://github.com/FreeSoft-AL/vocabulary">https://github.com/FreeSoft-AL/vocabulary</a> on GitHub.
</li>

<li>Make <b>gh-pages</b> the default branch on GitHub. GitHub will
automatically publish this branch to an address like this:
<a href="http://freesoft-al.github.io/vocabulary">http://freesoft-al.github.io/vocabulary</a> (it may take a few minutes
for it to be published).
</li>

<li>Optionally create a custom domain (as described <a href="https://help.github.com/articles/setting-up-a-custom-domain-with-github-pages/">here</a>) and redirect
it to GitHub.
</li>

<li>Customize the application by editing the file <a href="https://github.com/FreeSoft-AL/vocabulary/blob/gh-pages/config.js">config.js</a>. Some of
the things that need to be changed are app_url, disqus.shortname,
etc. The oauth2 settings can be left untouched.
</li>

<li>Customize the list of available languages and vocabularies by
editing <a href="https://github.com/FreeSoft-AL/vocabulary/blob/gh-pages/js/options.js">js/options.js</a>. These vocabularies must have been created
on the server first.
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Embedding inside a webpage</h2>
<div class="outline-text-2" id="text-3">
<p>
It can also be embedded in a frame inside an HTML page, like the
example shown here.
</p>

<!-- HTML generated using hilite.me -->
<div><pre style="margin-bottom: 10px; line-height: 125%"><span style="color: #6ab825; font-weight: bold">&lt;div</span> <span style="color: #bbbbbb">style=</span><span style="color: #ed9d13">&quot;width:300px; display:inline-block; float:right;</span>
<span style="color: #ed9d13">            border:1px solid #aaa; padding:0px; margin-left:10px;&quot;</span><span style="color: #6ab825; font-weight: bold">&gt;</span>
  <span style="color: #6ab825; font-weight: bold">&lt;iframe</span> <span style="color: #bbbbbb">src=</span><span style="color: #ed9d13">&quot;http://v.btranslator.org?lng=sq&amp;proj=ICT_sq&quot;</span>
          <span style="color: #bbbbbb">width=</span><span style="color: #ed9d13">&quot;100%&quot;</span> <span style="color: #bbbbbb">height=</span><span style="color: #ed9d13">&quot;395px&quot;</span>
          <span style="color: #bbbbbb">seamless=</span><span style="color: #ed9d13">&quot;seamless&quot;</span> <span style="color: #bbbbbb">frameborder=</span><span style="color: #ed9d13">&quot;0&quot;</span><span style="color: #6ab825; font-weight: bold">&gt;</span>
  <span style="color: #6ab825; font-weight: bold">&lt;/iframe&gt;</span>
<span style="color: #6ab825; font-weight: bold">&lt;/div&gt;</span>
</pre></div>
<!-- End HTML generated using hilite.me -->

<!-- HTML generated using hilite.me -->
<div><pre style="margin-bottom: 10px; line-height: 125%"><span style="color: #6ab825; font-weight: bold">&lt;div</span> <span style="color: #bbbbbb">style=</span><span style="color: #ed9d13">&quot;width:300px; display:inline-block;</span>
<span style="color: #ed9d13">     float:right; border:1px solid #aaa; padding:5px;&quot;</span><span style="color: #6ab825; font-weight: bold">&gt;</span>
  <span style="color: #6ab825; font-weight: bold">&lt;h3</span> <span style="color: #bbbbbb">style=</span><span style="color: #ed9d13">&quot;margin-top:0px; color:#2a2;&quot;</span><span style="color: #6ab825; font-weight: bold">&gt;</span>Vocabulary: ICT_sq<span style="color: #6ab825; font-weight: bold">&lt;/h3&gt;</span>

  <span style="color: #6ab825; font-weight: bold">&lt;iframe</span> <span style="color: #bbbbbb">src=</span><span style="color: #ed9d13">&quot;https://btranslator.org/vocabulary/ICT_sq?display=iframe&quot;</span>
          <span style="color: #bbbbbb">width=</span><span style="color: #ed9d13">&quot;100%&quot;</span> <span style="color: #bbbbbb">height=</span><span style="color: #ed9d13">&quot;350px&quot;</span>
          <span style="color: #bbbbbb">seamless=</span><span style="color: #ed9d13">&quot;seamless&quot;</span> <span style="color: #bbbbbb">frameborder=</span><span style="color: #ed9d13">&quot;0&quot;</span><span style="color: #6ab825; font-weight: bold">&gt;</span>
  <span style="color: #6ab825; font-weight: bold">&lt;/iframe&gt;</span>
<span style="color: #6ab825; font-weight: bold">&lt;/div&gt;</span>
</pre></div>
<!-- End HTML generated using hilite.me -->

<div style="width:300px; display:inline-block; float:right;
            border:1px solid #aaa; padding:0px; margin-left:10px;">
  <iframe src="http://v.btranslator.org?lng=sq&proj=ICT_sq"
          width="100%" height="395px"
          seamless="seamless" frameborder="0">
  </iframe>
</div>

<div style="width:300px; display:inline-block;
            float:right; border:1px solid #aaa; padding:5px;">
  <h3 style="margin-top:0px; color:#2a2;">Vocabulary: ICT_sq</h3>

  <iframe src="https://btranslator.org/vocabulary/ICT_sq?display=iframe"
          width="100%" height="350px"
          seamless="seamless" frameborder="0">
  </iframe>
</div>

<p style="clear:both"> </p>
</div>
</div>


<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Connecting to social networks.</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1">Disqus</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Create a discussion forum at <a href="https://disqus.com/admin/create/">https://disqus.com/admin/create/</a> and
put its name on <code>config.js</code>.
</p>
</div>
</div>


<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2">Twitter</h3>
<div class="outline-text-3" id="text-4-2">
<p>
Try something like this on terminal:
</p>
<pre class="example">
curl https://btranslator.org/tweet/sq/vocabulary/ICT_sq?url=http://v.btranslator.org
</pre>
<p>
Or open it it browser:
<a href="https://btranslator.org/tweet/sq/vocabulary/ICT_sq?url=http://v.btranslator.org">https://btranslator.org/tweet/sq/vocabulary/ICT_sq?url=http://v.btranslator.org</a>
</p>

<p>
Each time it will return a random term from the vocabulary, in a
format suitable for twitter. To make the process automatic, you can
use a script like <a href="https://github.com/B-Translator/btr_client/blob/master/utils/twitter.sh">twitter.sh</a>:
</p>
<pre class="example">
#!/bin/bash
### Send tweets from command line.

t='/usr/local/bin/t'
tweet=$(curl https://btranslator.org/tweet/sq/vocabulary/ICT_sq?url=http://v.btranslator.org)
mention=$($t followings | sort -R | tail -1)
$t update "$tweet @$mention"
</pre>

<p>
In Linux, calling this script can be automated with a cron job. For
example you can create the file <code>/etc/cron.d/twitter</code> with a
content like this:
</p>
<pre class="example">
### first create a user with `adduser twitter`
20 */12 * * *  twitter  /home/twitter/twitter.sh &gt; /dev/null 2&gt;&amp;1

### uncomment this line only for debugging
#*/5 * * * *  twitter  /home/twitter/twitter.sh
</pre>

<p>
For instructions on how to install the <b>t</b> twitter client, see:
<a href="http://xmodulo.com/2013/12/access-twitter-command-line-linux.html">http://xmodulo.com/2013/12/access-twitter-command-line-linux.html</a>
</p>
</div>
</div>


<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3">RSS</h3>
<div class="outline-text-3" id="text-4-3">
<p>
Try something like this on terminal:
</p>
<pre class="example">
curl https://btranslator.org/rss-feed/sq/vocabulary/ICT_sq?url=http://v.btranslator.org
</pre>
<p>
Or open it it browser:
<a href="https://btranslator.org/rss-feed/sq/vocabulary/ICT_sq?url=http://v.btranslator.org">https://btranslator.org/rss-feed/sq/vocabulary/ICT_sq?url=http://v.btranslator.org</a>
</p>

<p>
It return a RSS feed of the latest translations. Latest means
yesterday. Results are cached, so last minute translations may not
appear on the list.
</p>

<p>
There services like <a href="https://dlvr.it/">https://dlvr.it/</a> which can connect to rss feeds
and share the latest items to social networks (Facebook, LinkedIn,
etc.) See this article for some other tools:
<a href="http://www.twelveskip.com/guide/blogging/1189/best-auto-sharing-tools-social-media">http://www.twelveskip.com/guide/blogging/1189/best-auto-sharing-tools-social-media</a>
</p>
</div>
</div>
</div>


<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">Creating vocabularies on the server</h2>
<div class="outline-text-2" id="text-5">
<p>
<b>Note:</b> If you want to use <a href="https://btranslator.org">https://btranslator.org</a> as a server,
contact me and I can create a new vocabulary for you.
</p>

<ul class="org-ul">
<li>Make sure that the language of vocabulary is supported:

<ul class="org-ul">
<li>Go to B-Translator server:
<pre class="example">
docker-enter btr
cd /var/www/btr/profiles/btr_server/
</pre>
</li>

<li>Make sure that there is an entry for this language at the list
of languages <code>admin/languages</code>.
</li>

<li>Run the configuration script <code>install/config/languages.sh</code>:
<pre class="example">
==&gt; # install/config/languages.sh

===&gt; Languages supported by B-Translator Server

Do not remove 'fr', because sometimes French translations
are used instead of template files (when they are missing).

Enter language codes [fr]: fr de it es sq bg fi tr mk

You are about to execute 'vset btr_languages fr de it es sq bg fi tr mk' non-interactively (--yes forced) on all of the following targets:
  @local_btr.btr
  @local_btr.btr_dev
Continue?  (y/n): y
local_btr.btr_dev &gt;&gt; btr_languages was set to "fr de it es sq bg fi tr mk".              [success]
local_btr.btr     &gt;&gt; btr_languages was set to "fr de it es sq bg fi tr mk".              [success]
You are about to execute 'php-eval module_load_include('inc', 'btrCore', 'btrCore.admin'); btrCore_config_set_languages();' non-interactively (--yes forced) on all of the following targets:
  @local_btr.btr
  @local_btr.btr_dev
Continue?  (y/n): y
You are about to execute 'language-add fr' non-interactively (--yes forced) on all of the following targets:
  @local_btr.btr
  @local_btr.btr_dev
Continue?  (y/n): y
local_btr.btr_dev &gt;&gt; The language with code fr already exists.                           [warning]
local_btr.btr     &gt;&gt; The language with code fr already exists.                           [warning]

[ . . . . . . . . . . . . . . . . . . . . . ]
</pre>
</li>
</ul>
</li>

<li>Create a vocabulary:
<pre class="example">
drush @btr btrv-add ICT sq $(pwd)/ICT_sq.po
</pre>

<p>
The name of the vocabulary is <b>ICT_sq</b> (having the language code
as an appendix). The PO file that is used to initialize the
vocabulary must have the same name as the vocabulary. Each entry
in the PO file must have the name of the vocabulary as a context,
like this:
</p>
<pre class="example">
msgctxt "ICT_sq"
</pre>

<p>
However the PO file is optional and it can be omitted in order to
create an empty vocabulary (terms can be added from the
application).
</p>

<p>
You can also get a list of vocabularies and delete a vocabulary:
</p>
<pre class="example">
drush @btr btrv-ls
drush @btr btrv-del ICT sq
</pre>
</li>
</ul>
</div>
</div>
</div>
